{"modelTopology":{"class_name":"Model","config":{"name":"decoder","layers":[{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"dense_Dense20","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true},"inbound_nodes":[[["input8",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization13","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization13","trainable":true},"inbound_nodes":[[["dense_Dense20",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU13","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU13","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization13",0,0,{}]]]},{"name":"dense_Dense21","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU13",0,0,{}]]]},{"name":"dense_Dense23","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense23","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU13",0,0,{}]]]},{"name":"dense_Dense25","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU13",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization14","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization14","trainable":true},"inbound_nodes":[[["dense_Dense21",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization15","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization15","trainable":true},"inbound_nodes":[[["dense_Dense23",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization16","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization16","trainable":true},"inbound_nodes":[[["dense_Dense25",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU14","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU14","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization14",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU15","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU15","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization15",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU16","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU16","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization16",0,0,{}]]]},{"name":"dense_Dense22","class_name":"Dense","config":{"units":864,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU14",0,0,{}]]]},{"name":"dense_Dense24","class_name":"Dense","config":{"units":864,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU15",0,0,{}]]]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":864,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU16",0,0,{}]]]}],"input_layers":[["input8",0,0]],"output_layers":[["dense_Dense22",0,0],["dense_Dense24",0,0],["dense_Dense26",0,0]]},"keras_version":"tfjs-layers 1.7.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense20/kernel","shape":[2,512],"dtype":"float32"},{"name":"dense_Dense20/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense21/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense23/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense23/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense25/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense22/bias","shape":[864],"dtype":"float32"},{"name":"dense_Dense24/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[864],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[864],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_variance","shape":[512],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.4","convertedBy":null}