{"modelTopology":{"class_name":"Model","config":{"name":"decoder","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["dense_Dense7",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU5","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU5","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization5",0,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU5",0,0,{}]]]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU5",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU5",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization6","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization6","trainable":true},"inbound_nodes":[[["dense_Dense8",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization7","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization7","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization8","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization8","trainable":true},"inbound_nodes":[[["dense_Dense12",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU6","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU6","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization6",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU7","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU7","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization7",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU8","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU8","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization8",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":144,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU6",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":144,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU7",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":144,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU8",0,0,{}]]]}],"input_layers":[["input4",0,0]],"output_layers":[["dense_Dense9",0,0],["dense_Dense11",0,0],["dense_Dense13",0,0]]},"keras_version":"tfjs-layers 1.7.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7/kernel","shape":[2,1024],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[1024],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[1024],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[1024],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[1024,512],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense10/kernel","shape":[1024,512],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[1024,512],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[512,144],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[144],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[512,144],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[144],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[512,144],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[144],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[1024],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[1024],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_variance","shape":[512],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.4","convertedBy":null}