{"modelTopology":{"class_name":"Model","config":{"name":"encoder","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,864],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,864],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,864],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["dense_Dense3",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU1","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU2","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU3","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU1",0,0,{}],["leaky_re_lu_LeakyReLU2",0,0,{}],["leaky_re_lu_LeakyReLU3",0,0,{}],["input4",0,0,{}],["input5",0,0,{}],["input6",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU4","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization4",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU5","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU5","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization5",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU5",0,0,{}]]]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU5",0,0,{}]]]},{"name":"sample_layer_sampleLayer1","class_name":"sampleLayer","config":{"name":"sample_layer_sampleLayer1","trainable":true},"inbound_nodes":[[["dense_Dense6",0,0,{}],["dense_Dense7",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0],["input4",0,0],["input5",0,0],["input6",0,0]],"output_layers":[["dense_Dense6",0,0],["dense_Dense7",0,0],["sample_layer_sampleLayer1",0,0]]},"keras_version":"tfjs-layers 3.6.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[864,64],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[864,64],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[864,64],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[195,64],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[2],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[32],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.6.0","convertedBy":null}