{"modelTopology":{"class_name":"Model","config":{"name":"decoder","layers":[{"name":"input24","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input24"},"inbound_nodes":[]},{"name":"dense_Dense72","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense72","trainable":true},"inbound_nodes":[[["input24",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization45","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization45","trainable":true},"inbound_nodes":[[["dense_Dense72",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU45","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU45","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization45",0,0,{}]]]},{"name":"dense_Dense73","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense73","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU45",0,0,{}]]]},{"name":"dense_Dense75","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense75","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU45",0,0,{}]]]},{"name":"dense_Dense77","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense77","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU45",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization46","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization46","trainable":true},"inbound_nodes":[[["dense_Dense73",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization47","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization47","trainable":true},"inbound_nodes":[[["dense_Dense75",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization48","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization48","trainable":true},"inbound_nodes":[[["dense_Dense77",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU46","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU46","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization46",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU47","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU47","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization47",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU48","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU48","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization48",0,0,{}]]]},{"name":"dense_Dense74","class_name":"Dense","config":{"units":288,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense74","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU46",0,0,{}]]]},{"name":"dense_Dense76","class_name":"Dense","config":{"units":288,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense76","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU47",0,0,{}]]]},{"name":"dense_Dense78","class_name":"Dense","config":{"units":288,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense78","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU48",0,0,{}]]]}],"input_layers":[["input24",0,0]],"output_layers":[["dense_Dense74",0,0],["dense_Dense76",0,0],["dense_Dense78",0,0]]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense72/kernel","shape":[2,512],"dtype":"float32"},{"name":"dense_Dense72/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization45/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization45/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense73/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense73/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense75/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense75/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense77/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense77/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization46/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization46/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization47/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization47/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization48/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization48/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense74/kernel","shape":[512,288],"dtype":"float32"},{"name":"dense_Dense74/bias","shape":[288],"dtype":"float32"},{"name":"dense_Dense76/kernel","shape":[512,288],"dtype":"float32"},{"name":"dense_Dense76/bias","shape":[288],"dtype":"float32"},{"name":"dense_Dense78/kernel","shape":[512,288],"dtype":"float32"},{"name":"dense_Dense78/bias","shape":[288],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization45/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization45/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization46/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization46/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization47/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization47/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization48/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization48/moving_variance","shape":[512],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null}